#include "std_lib_facilities.h"

int main()
{
    cout << "Введите имя адресата:\n";
    string first_name = " ";
    cin >> first_name;
    cout << "Введите возраст адресата:\n";
    int age = 1;
    cin >> age;
    if (age < 0 || age >= 110)
        simple_error("Ты шутишь!\n");
    string friend_name;
    char friend_sex = 'm';
    cout << "Введите имя друга и его пол: - мужчина, f - женищина\n";
    cin >> friend_name >> friend_sex;
    cout << "Дорогой, " << first_name << "!\n"
    << "Как твое самочувствие? "
    << first_name << ", искренне надеюсь, "
    << " что в эти непростые времена, наша дружба помогает тебе.\n"
    << " Тогда как везде идет спад"
    << "ты демонстрируешь внушительный результат.\n";
    if (friend_sex == 'f')
    {
        cout << "Если ты увидишь " << friend_name
        << ",  попроси ее позвонить мне. Мне кажется ей нужна помощь.\n";
    }
    else
    {
        cout << "Если ты увидишь " << friend_name
        << ",  попроси его позвонить мне. Мне кажется ему нужна помощь.\n";
    }
    if (age < 12 && age > 4)
        cout << "На следующий год тебе исполнится "
        << age++ << "лет.\n";
    else if(age <= 4)
        cout << "На следующий год тебе исполнится "
        << age++ << "года.\n";
    else if (age >= 70)
        cout << "Надеюсь ты не скучаешь на пенсии.\n";
    cout << "Искренне твой\n" << "\n"
    << "\nПавел \n";
    return 0;
}
